app/controllers/artists_controller.rb

    def set_artist
      @artist = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]