app/controllers/posts_controller.rb

  def create
    (byebug)
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "user_id", "comment", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hello"], ["user_id", 1], ["comment", "Post"], ["created_at", 2017-03-11 18:35:13 UTC], ["updated_at", 2017-03-11 18:35:13 UTC]]

  def reply
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]