app/controllers/release_groups_controller.rb

SELECT "release_groups".* FROM "release_groups"
---
  def index
    @release_groups = ReleaseGroup.all