app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at", "password_digest", "email") VALUES (?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save